["```py\ntext = \"\"\"Dear Amazon, last week I ordered an Optimus Prime action figure\nfrom your online store in Germany. Unfortunately, when I opened the package,\nI discovered to my horror that I had been sent an action figure of Megatron\ninstead! As a lifelong enemy of the Decepticons, I hope you can understand my\ndilemma. To resolve the issue, I demand an exchange of Megatron for the\nOptimus Prime figure I ordered. Enclosed are copies of my records concerning\nthis purchase. I expect to hear from you soon. Sincerely, Bumblebee.\"\"\"\n```", "```py\nfrom transformers import pipeline\n\nclassifier = pipeline(\"text-classification\")\n```", "```py\nimport pandas as pd\n\noutputs = classifier(text)\npd.DataFrame(outputs)\n```", "```py\nner_tagger = pipeline(\"ner\", aggregation_strategy=\"simple\")\noutputs = ner_tagger(text)\npd.DataFrame(outputs)\n```", "```py\nreader = pipeline(\"question-answering\")\nquestion = \"What does the customer want?\"\noutputs = reader(question=question, context=text)\npd.DataFrame([outputs])\n```", "```py\nsummarizer = pipeline(\"summarization\")\noutputs = summarizer(text, max_length=45, clean_up_tokenization_spaces=True)\nprint(outputs[0]['summary_text'])\n```", "```py\n Bumblebee ordered an Optimus Prime action figure from your online store in\nGermany. Unfortunately, when I opened the package, I discovered to my horror\nthat I had been sent an action figure of Megatron instead.\n```", "```py\ntranslator = pipeline(\"translation_en_to_de\",\n                      model=\"Helsinki-NLP/opus-mt-en-de\")\noutputs = translator(text, clean_up_tokenization_spaces=True, min_length=100)\nprint(outputs[0]['translation_text'])\n```", "```py\nSehr geehrter Amazon, letzte Woche habe ich eine Optimus Prime Action Figur aus\nIhrem Online-Shop in Deutschland bestellt. Leider, als ich das Paket öffnete,\nentdeckte ich zu meinem Entsetzen, dass ich stattdessen eine Action Figur von\nMegatron geschickt worden war! Als lebenslanger Feind der Decepticons, Ich\nhoffe, Sie können mein Dilemma verstehen. Um das Problem zu lösen, Ich fordere\neinen Austausch von Megatron für die Optimus Prime Figur habe ich bestellt.\nAnbei sind Kopien meiner Aufzeichnungen über diesen Kauf. Ich erwarte, bald von\nIhnen zu hören. Aufrichtig, Bumblebee.\n```", "```py\ngenerator = pipeline(\"text-generation\")\nresponse = \"Dear Bumblebee, I am sorry to hear that your order was mixed up.\"\nprompt = text + \"\\n\\nCustomer service response:\\n\" + response\noutputs = generator(prompt, max_length=200)\nprint(outputs[0]['generated_text'])\n```", "```py\nDear Amazon, last week I ordered an Optimus Prime action figure from your online\nstore in Germany. Unfortunately, when I opened the package, I discovered to my\nhorror that I had been sent an action figure of Megatron instead! As a lifelong\nenemy of the Decepticons, I hope you can understand my dilemma. To resolve the\nissue, I demand an exchange of Megatron for the Optimus Prime figure I ordered.\nEnclosed are copies of my records concerning this purchase. I expect to hear\nfrom you soon. Sincerely, Bumblebee.\n\nCustomer service response:\nDear Bumblebee, I am sorry to hear that your order was mixed up. The order was\ncompletely mislabeled, which is very common in our online store, but I can\nappreciate it because it was my understanding from this site and our customer\nservice of the previous day that your order was not made correct in our mind and\nthat we are in a process of resolving this matter. We can assure you that your\norder\n```"]