["```py\na stock photo of a business meeting\n```", "```py\nan oil painting of a business meeting\n```", "```py\nan oil painting of a business meeting, textured oil-on-canvas\nusing thick impasto and swirling dynamic brushstrokes\n```", "```py\nan ancient Egyptian hieroglyph of a business meeting\n```", "```py\nillustration of a dragon, in the style of Alice's Adventures in Wonderland\nby Lewis Carroll\n```", "```py\na space whale, trending on artstation\n```", "```py\noil painting in the style of Rembrandt --no frame, wall\n```", "```py\na Scottish female astronaut --no Karen Gillan\n```", "```py\nHomer Simpson --no cartoon\n```", "```py\npainting of the Golden Gate Bridge::1 in the style of Van\nGogh::0.8, in the style of Dali::0.2\n```", "```py\npainting of the Golden Gate Bridge::1 in the style of Van\nGogh::-1, in the style of Dali::5\n```", "```py\nhttps://s.mj.run/XkIHsYIdUxc in the style of The Great Gatsby\n```", "```py\nphotograph of glamorous woman in a 1920s flapper party,\nwearing a sequin dress, wide angle, in color, 3 5 mm, dslr\n```", "```py\nVan Gogh style dress, inspired by Starry Night, blue and\nyellow swirls, extremely detailed, very well lit, studio\nlight, 3.5 mm, dslr\n```", "```py\nphotograph of glamorous woman in a 1920s flapper party,\nwearing a sequin dress, wide angle, in color, 3 5 mm, dslr\n```", "```py\ntwo images side by side, rockstar American rough and ready\nmiddle-age jawline actor man, photo booth portrait --ar 2:1\n```", "```py\nside profile image, rockstar American rough and ready\nmiddle-age jawline actor man, photo booth portrait --ar 2:1\n```", "```py\na dachshund dog in the style of Banksy\n```", "```py\nWhat's the medium that the artist Banksy mostly used? Respond\nin 1-3 words only.\n```", "```py\nStreet art\n```", "```py\nstreet art of a dachshund dog in the style of Banksy\n```", "```py\na painting of Times Square in the style of \"The Persistence\nof Memory\" by Salvador Dali\n```", "```py\nBriefly describe the characteristics and artistic style of\n\"The Persistence of Memory\" by Salvador Dali, without\nmentioning the artwork or the artist:\n```", "```py\nThis is a notable example of Surrealist art, steeped in\ndream-like, fantastical imagery that pushes the boundaries of\ntraditional understanding and interpretation. The painting is\ncomposed with a distinctly precise and detailed technique,\nreflecting a deceptive realism.\n\n...\n\nContrasting with the melting objects, there are other items\nin the scene that exhibit solidity and permanence, creating\nan uncanny juxtaposition. The painting's composition and\nimagery invite deep exploration and various interpretations,\nconcerning themes of reality, dreams, time, and the\nsubconscious. Overall, it is a visually striking work that\nembodies the ethos of its movement: challenging the viewer's\nperceptions and exploring the unconventional and the\nirrational.\n```", "```py\nConvert this description into a shortened prompt for an AI\nimage generation model such as DALL-E:\n```", "```py\nSurrealist landscape with subdued colors of brown, blue, and\nyellow. Depict a barren, craggy shoreline and calm sea\nmeeting a clear sky. Include amorphous, melting objects\nresembling common items, indicating fluidity and impermanence\nof time. Contrast these with other solid, permanent elements.\nEvoke a sense of stillness, dreamlike atmosphere, and\nquietude.\n```", "```py\nPainting of Times Square, surrealist landscape with subdued colors\nof brown, blue, and yellow, a barren, craggy shoreline and calm\nsea meeting a clear sky. Include amorphous, melting objects\nresembling common items, indicating fluidity and impermanence\nof time. Contrast these with other solid, permanent elements.\nEvoke a sense of stillness, dreamlike atmosphere, and quietude.\n```", "```py\nPainting of Times Square, surrealist landscape with subdued\ncolors of orange, red, and green, imposing buildings and calm\nriver meeting a stormy sky. The amorphous melting dripping\nclock in the center of the square indicates the fluidity and\nimpermanence of time in contrast with other solid, permanent\nelements. Evoke a sense of stillness, dreamlike atmosphere,\nand quietude.\n```", "```py\nportrait of Homer Simpson as a Soviet factory worker, gritty,\ndirty, beautiful, very detailed, hyperrealistic, medium shot,\nvery detailed painting by Glenn Fabry, by Joao Ruas --no\ncartoon\n```", "```py\nportrait of Homer Simpson as a Soviet factory worker, gritty,\ndirty, beautiful, very detailed, hyperrealistic, medium shot,\nvery detailed painting by Glenn Fabry, by Joao Ruas\n--no cartoon\n```", "```py\n**portrait** (0.08) of **homer simpson** (1.00) as a\n**soviet** (0.19) **factory** (0.21) **worker** (0.08), gritty (0.02), dirty (0.02), beautiful (0.00), very (0.00) ```", "```py```", "```py```", "````py (0.00), very (0.00) detailed (0.01) painting (0.05) by Glenn ````", "``` Fabry (0.08), by `**Joao Ruas**` (0.09) ```", "```py`` ██████████ homer simpson ```", "```py` ██░░░░░░░░ factory ```", "```py ██░░░░░░░░ soviet ```", "```py` █░░░░░░░░░ worker ```", "```py ```", "```py`` ```", "```py ```", "```py` ```", "```py`` ```", "```py```", "``````py```` ```py``````", "```\n\n ```", "```  ```"]